{"format": "graph-model", "generatedBy": "2.13.0-rc0", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "360"}, {"size": "648"}, {"size": "3"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "360"}, {"size": "648"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model/lambda/wa/Resize/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.concat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.concat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.concat_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/lambda_1/wa/upsample/Resize/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "360"}, {"size": "648"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/lambda/wa/Resize", "op": "ResizeBilinear", "input": ["input", "PartitionedCall/model/lambda/wa/Resize/size"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "PartitionedCall/model/tf.math.multiply/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["PartitionedCall/model/lambda/wa/Resize", "unknown"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.subtract/Sub", "op": "Sub", "input": ["PartitionedCall/model/tf.math.multiply/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d/depthwise", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.convolution/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.math.add/Add", "unknown_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.add_1/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.nn.convolution/convolution", "unknown_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.relu/Relu", "op": "Relu", "input": ["PartitionedCall/model/tf.math.add_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["PartitionedCall/model/tf.nn.relu/Relu", "unknown_3"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.add_2/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_1/depthwise", "unknown_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.convolution_1/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.math.add_2/Add", "unknown_5"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.add_3/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.nn.convolution_1/convolution", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.relu_1/Relu", "op": "Relu", "input": ["PartitionedCall/model/tf.math.add_3/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_2/depthwise", "op": "DepthwiseConv2dNative", "input": ["PartitionedCall/model/tf.nn.relu_1/Relu", "unknown_7"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.convolution_2/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_2/depthwise", "unknown_9"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.relu_2/Relu", "op": "Relu", "input": ["PartitionedCall/model/tf.nn.convolution_2/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_3/depthwise", "op": "DepthwiseConv2dNative", "input": ["PartitionedCall/model/tf.nn.relu_2/Relu", "unknown_11"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.convolution_3/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_3/depthwise", "unknown_13"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.relu_3/Relu", "op": "Relu", "input": ["PartitionedCall/model/tf.nn.convolution_3/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.concat/concat", "op": "ConcatV2", "input": ["PartitionedCall/model/tf.nn.relu_2/Relu", "PartitionedCall/model/tf.nn.relu_3/Relu", "PartitionedCall/model/tf.concat/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_4/depthwise", "op": "DepthwiseConv2dNative", "input": ["PartitionedCall/model/tf.concat/concat", "unknown_15"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.convolution_4/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_4/depthwise", "unknown_17"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.add_9/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.nn.convolution_4/convolution", "unknown_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.relu_4/Relu", "op": "Relu", "input": ["PartitionedCall/model/tf.math.add_9/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.concat_1/concat", "op": "ConcatV2", "input": ["PartitionedCall/model/tf.nn.relu_1/Relu", "PartitionedCall/model/tf.nn.relu_4/Relu", "PartitionedCall/model/tf.concat_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_5/depthwise", "op": "DepthwiseConv2dNative", "input": ["PartitionedCall/model/tf.concat_1/concat", "unknown_19"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.add_10/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_5/depthwise", "unknown_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.convolution_5/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.math.add_10/Add", "unknown_21"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.add_11/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.nn.convolution_5/convolution", "unknown_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.relu_5/Relu", "op": "Relu", "input": ["PartitionedCall/model/tf.math.add_11/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.concat_2/concat", "op": "ConcatV2", "input": ["PartitionedCall/model/tf.nn.relu/Relu", "PartitionedCall/model/tf.nn.relu_5/Relu", "PartitionedCall/model/tf.concat_2/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_6/depthwise", "op": "DepthwiseConv2dNative", "input": ["PartitionedCall/model/tf.concat_2/concat", "unknown_23"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.add_12/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d_6/depthwise", "unknown_24"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.convolution_6/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.math.add_12/Add", "unknown_25"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.add_13/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.nn.convolution_6/convolution", "unknown_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.tanh/Tanh", "op": "Tanh", "input": ["PartitionedCall/model/tf.math.add_13/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/lambda_1/wa/upsample/Resize", "op": "ResizeBilinear", "input": ["PartitionedCall/model/tf.math.tanh/Tanh", "PartitionedCall/model/lambda_1/wa/upsample/Resize/size"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": true}, "half_pixel_centers": {"b": false}}}, {"name": "PartitionedCall/model/tf.math.multiply_3/Mul", "op": "Mul", "input": ["PartitionedCall/model/lambda_1/wa/upsample/Resize", "PartitionedCall/model/tf.math.subtract/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_14/Add", "op": "AddV2", "input": ["input", "PartitionedCall/model/tf.math.multiply_3/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_5/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model/tf.math.add_14/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.subtract_1/Sub", "op": "Sub", "input": ["PartitionedCall/model/tf.math.multiply_5/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model/tf.math.add_14/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_8/Mul", "op": "Mul", "input": ["PartitionedCall/model/lambda_1/wa/upsample/Resize", "PartitionedCall/model/tf.math.subtract_1/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_15/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.add_14/Add", "PartitionedCall/model/tf.math.multiply_8/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_10/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model/tf.math.add_15/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.subtract_2/Sub", "op": "Sub", "input": ["PartitionedCall/model/tf.math.multiply_10/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model/tf.math.add_15/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_13/Mul", "op": "Mul", "input": ["PartitionedCall/model/lambda_1/wa/upsample/Resize", "PartitionedCall/model/tf.math.subtract_2/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_16/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.add_15/Add", "PartitionedCall/model/tf.math.multiply_13/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_15/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model/tf.math.add_16/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.subtract_3/Sub", "op": "Sub", "input": ["PartitionedCall/model/tf.math.multiply_15/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model/tf.math.add_16/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_18/Mul", "op": "Mul", "input": ["PartitionedCall/model/lambda_1/wa/upsample/Resize", "PartitionedCall/model/tf.math.subtract_3/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_17/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.add_16/Add", "PartitionedCall/model/tf.math.multiply_18/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_20/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model/tf.math.add_17/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.subtract_4/Sub", "op": "Sub", "input": ["PartitionedCall/model/tf.math.multiply_20/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model/tf.math.add_17/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_23/Mul", "op": "Mul", "input": ["PartitionedCall/model/lambda_1/wa/upsample/Resize", "PartitionedCall/model/tf.math.subtract_4/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_18/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.add_17/Add", "PartitionedCall/model/tf.math.multiply_23/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_25/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model/tf.math.add_18/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.subtract_5/Sub", "op": "Sub", "input": ["PartitionedCall/model/tf.math.multiply_25/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model/tf.math.add_18/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_28/Mul", "op": "Mul", "input": ["PartitionedCall/model/lambda_1/wa/upsample/Resize", "PartitionedCall/model/tf.math.subtract_5/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_19/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.add_18/Add", "PartitionedCall/model/tf.math.multiply_28/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_30/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model/tf.math.add_19/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.subtract_6/Sub", "op": "Sub", "input": ["PartitionedCall/model/tf.math.multiply_30/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model/tf.math.add_19/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_33/Mul", "op": "Mul", "input": ["PartitionedCall/model/lambda_1/wa/upsample/Resize", "PartitionedCall/model/tf.math.subtract_6/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_20/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.add_19/Add", "PartitionedCall/model/tf.math.multiply_33/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_35/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model/tf.math.add_20/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.subtract_7/Sub", "op": "Sub", "input": ["PartitionedCall/model/tf.math.multiply_35/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model/tf.math.add_20/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_38/Mul", "op": "Mul", "input": ["PartitionedCall/model/lambda_1/wa/upsample/Resize", "PartitionedCall/model/tf.math.subtract_7/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/output/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.add_20/Add", "PartitionedCall/model/tf.math.multiply_38/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model/output/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/model/lambda/wa/Resize/size", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [3, 3, 3, 1], "dtype": "float32"}, {"name": "unknown_0", "shape": [3], "dtype": "float32"}, {"name": "unknown_1", "shape": [1, 1, 3, 32], "dtype": "float32"}, {"name": "unknown_2", "shape": [32], "dtype": "float32"}, {"name": "unknown_3", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "unknown_4", "shape": [32], "dtype": "float32"}, {"name": "unknown_5", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "unknown_6", "shape": [32], "dtype": "float32"}, {"name": "unknown_7", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "unknown_9", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "unknown_11", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "unknown_13", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "PartitionedCall/model/tf.concat/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_15", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "unknown_17", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "unknown_18", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/model/tf.concat_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_19", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "unknown_20", "shape": [64], "dtype": "float32"}, {"name": "unknown_21", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "unknown_22", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/model/tf.concat_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_23", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "unknown_24", "shape": [64], "dtype": "float32"}, {"name": "unknown_25", "shape": [1, 1, 64, 3], "dtype": "float32"}, {"name": "unknown_26", "shape": [3], "dtype": "float32"}, {"name": "PartitionedCall/model/lambda_1/wa/upsample/Resize/size", "shape": [2], "dtype": "int32"}]}]}